Tekla.Structures.Internal.CustomPartHelper
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.CustomPartHelper.AddPlugin(Tekla.Structures.Internal.StructuresPluginDescriptor)
DO NOT USE! For internal usage only!
structuresPlugin:
Returns:

Tekla.Structures.Internal.CustomPartHelper.SetCurrentPlugin(Tekla.Structures.Internal.ITsInvoker,System.Object)
DO NOT USE! For internal usage only!
Invoker:
currentPlugin:
Returns:

Tekla.Structures.Internal.CustomPartHelper.GetCurrentPlugin
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.CustomPartHelper.DefineInput
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.CustomPartHelper.Run
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.CustomPartHelper.GetInputFromCore
TODO: This should be refactored, since it's exactly the same as in ModelPluginHelper.
Returns: List of input items for the plugin